app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.set_confirmation_token

    message =  if @user.save
---
INSERT INTO "users" ("confirmation_token", "created_at", "email", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["confirmation_token", "_0BACDSNJNiYtDiylkQ7aQ"], ["created_at", Sat, 05 Apr 2014 22:45:55 UTC +00:00], ["email", "vidadelaempresa@gmail.com"], ["updated_at", Sat, 05 Apr 2014 22:45:55 UTC +00:00]]

  def confirm
    @user = User.find_by_confirmation_token params[:confirmation_token]
    @user.update_attribute(:confirmed_at, Time.now)
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = 's1_EzD7xU23tv2NFokSQPg' LIMIT 1
UPDATE "users" SET "confirmed_at" = $1, "updated_at" = $2 WHERE "users"."id" = 21  [["confirmed_at", Sat, 05 Apr 2014 23:01:07 UTC +00:00], ["updated_at", Sat, 05 Apr 2014 23:01:07 UTC +00:00]]

  def resend_confirmation
    @user = User.find_by_email params[:user][:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1